In [59]:
import pandas as pd

In [60]:
df = pd.read_csv("Data/hop.csv")
print(df)

              Name  Age            Course    Score
0            David   18  Computer Science       85
1            Aisha   17       Mathematics       92
2           Samuel   19           Physics       78
3         Blessing   18         Chemistry       88
4          Michael   20       Engineering       90
5           Daniel   18        Statistics       74
6            Faith   17           Biology       81
7           Joshua   19  Computer Science       89
8           Esther   18       Mathematics       95
9         Emmanuel   20           Physics       67
10           Grace   17         Chemistry       84
11          Joseph   19       Engineering       91
12         Deborah   18           Biology       76
13         Ibrahim   20        Statistics       88
14            Ruth   17  Computer Science       93
15           Peter   19       Mathematics       70
16           Sarah   18           Physics       86
17           Abdul   20         Chemistry       79
18        Victoria   17       Engineering       94
19           Tunde   19           Biology       82

In [61]:
df.head()
df.tail()
df.info
df.describe

<bound method NDFrame.describe of               Name  Age            Course    Score
0            David   18  Computer Science       85
1            Aisha   17       Mathematics       92
2           Samuel   19           Physics       78
3         Blessing   18         Chemistry       88
4          Michael   20       Engineering       90
5           Daniel   18        Statistics       74
6            Faith   17           Biology       81
7           Joshua   19  Computer Science       89
8           Esther   18       Mathematics       95
9         Emmanuel   20           Physics       67
10           Grace   17         Chemistry       84
11          Joseph   19       Engineering       91
12         Deborah   18           Biology       76
13         Ibrahim   20        Statistics       88
14            Ruth   17  Computer Science       93
15           Peter   19       Mathematics       70
16           Sarah   18           Physics       86
17           Abdul   20         Chemistry       79
18        Victoria   17       Engineering       94
19           Tunde   19           Biology       82>

In [62]:
print(df)
df['                Name']
df["     Age"]

              Name  Age            Course    Score
0            David   18  Computer Science       85
1            Aisha   17       Mathematics       92
2           Samuel   19           Physics       78
3         Blessing   18         Chemistry       88
4          Michael   20       Engineering       90
5           Daniel   18        Statistics       74
6            Faith   17           Biology       81
7           Joshua   19  Computer Science       89
8           Esther   18       Mathematics       95
9         Emmanuel   20           Physics       67
10           Grace   17         Chemistry       84
11          Joseph   19       Engineering       91
12         Deborah   18           Biology       76
13         Ibrahim   20        Statistics       88
14            Ruth   17  Computer Science       93
15           Peter   19       Mathematics       70
16           Sarah   18           Physics       86
17           Abdul   20         Chemistry       79
18        Victoria   17       Engineering       94
19           Tunde   19           Biology       82

0     18
1     17
2     19
3     18
4     20
5     18
6     17
7     19
8     18
9     20
10    17
11    19
12    18
13    20
14    17
15    19
16    18
17    20
18    17
19    19
Name:      Age, dtype: int64

In [63]:
df.iloc[0]
df.iloc[0:5]            
df.iloc[0:9]
df.iloc[0:10]

             Name  Age            Course    Score
0           David   18  Computer Science       85
1           Aisha   17       Mathematics       92
2          Samuel   19           Physics       78
3        Blessing   18         Chemistry       88
4         Michael   20       Engineering       90
5          Daniel   18        Statistics       74
6           Faith   17           Biology       81
7          Joshua   19  Computer Science       89
8          Esther   18       Mathematics       95
9        Emmanuel   20           Physics       67